{
  "program_id": "2261",
  "program_details": {
    "name": "CASA Cuba",
    "academic_calendar": "Similar to VU",
    "program_type": "Study Center/University Hybrid",
    "minimum_gpa": "2.75",
    "language_prerequisite": "Yes",
    "additional_prerequisites": "SPAN 3303",
    "housing": "Homestay, Hostel/Hotel"
  },
  "budget_info": {
    "spring_2025": {
      "term": "Spring",
      "year": "2025",
      "total_estimated_cost": "$42,103"
    }
  },
  "main_page_url": "https://www.vanderbilt.edu/study-abroad/programs/?program_id=2261",
  "homepage_url": "https://casa.education/havana",
  "img_url": "https://cdn.vanderbilt.edu/vu-URL/wp-content/uploads/sites/284/2017/12/19173130/brochure_2261-e1515186387496.jpg",
  "sections": [
    {
      "title": "Program Overview",
      "content": []
    },
    {
      "title": "What is CASA?",
      "content": [
        "<p>CASA is a consortium of leading universities including Vanderbilt University, Brown University, Columbia University, Cornell University, Dartmouth College, Harvard University, Johns Hopkins University, Northwestern University and the University of Pennsylvania. CASA focuses on offering high-quality study abroad opportunities in select locations around the world.</p>"
      ]
    },
    {
      "title": "At a Glance",
      "content": [
        "<p>This program is administered by the Consortium for Advanced Studies Abroad (<a href=\"http://casa.education/\">CASA</a>), a partnership of Ivy Plus universities including Vanderbilt. The goals of this immersive Spanish language program is to improve students’ oral and written skills; to facilitate students' knowledge of contemporary Cuba and the Caribbean region; to provide students with the opportunity to access two of Cuba’s leading institutions of higher learning: the <a href=\"http://www.uh.cu/\">University of Havana</a>, and <a href=\"http://www.casa.co.cu/\">Casa de Las Américas</a><strong> </strong>(the Cuban government’s premier research institution). Study Abroad offers this program in conjunction with Vanderbilt's Center for Latin American Studies.</p>",
        "<p>In addition to the academic program, the CASA Cuba study center will arrange special topics-based lectures, exhibitions, recitals, and field visits to expose students to the tremendous cultural mosaic of the country.</p>",
        "<p>Students wishing to enroll in CASA Cuba must have completed SPAN 3303, <strong>or </strong>four or more other SPAN courses at the 3000-level. Applicants <strong>must </strong>have SPAN 3303 on their transcript in order to receive credit toward the Literature distribution of the Spanish major/minor. Students should be sure to check the external section of their Vanderbilt transcript to verify any transfer or AP credit on their record. Students should consult the <a href=\"https://www.vanderbilt.edu/catalogs/undergraduate/\">Undergraduate Course Catalogue</a> for details and limitations. Contact the Study Abroad advisor advisor or the Director of Undergraduate Studies in Spanish with questions.</p>"
      ]
    },
    {
      "title": "Academics",
      "content": [
        "<p>Students will enroll in up to four courses, all of which are taught in Spanish. It is recommended that students take a combination of courses: two offered through CASA Cuba and two direct-enrollment courses through the University of Havana.</p>",
        "<p>At the University of Havana, students are encouraged to enroll in courses at the <a href=\"http://www.uh.cu/Etiquetas/Facultad-de-Artes-y-Letras\" target=\"_blank\">Faculty of Arts and Letters</a> or the <a href=\"http://www.uh.cu/Etiquetas/Facultad-de-Filosofia-e-Historia\" target=\"_blank\">Faculty of Philosophy and History</a>. However, with permission from the University of Havana, enrollment is possible in departments and faculties beyond these two.</p>",
        "<p>Courses will be complemented throughout the semester with special seminars and guest lectures by respected experts from key research centers. In addition, interested students will be encouraged to carry out focused research projects that will engage them with recognized Cuban disciplinary experts and connect them with local archives, museums, and key cultural organizations.</p>"
      ]
    },
    {
      "title": "Areas of Study",
      "content": [
        "<p>Literature, History, Art, Afro-Caribbean Studies, Music, Philosophy, Religion, Political Sociology, Latin American Thought, and Public Health</p>",
        "<p><a href=\"https://www.brown.edu/academics/college/special-programs/international-study/sites/brown.edu.academics.college.special-programs.international-study/files/uploads/CASA-Cuba%20Courses%20-%20Spring%202016.pdf\">Course Catalog (partial)</a></p>",
        "<p>Vanderbilt will use the scale shown here to articulate all grades from the University of Havana, regardless of the subject area or language of instruction.</p>",
        "<figure><table><thead><tr><th><strong>University of Havana </strong></th><th><strong>Vanderbilt Grade Equivalents </strong></th></tr></thead><tbody><tr><td>5</td><td>A</td></tr><tr><td>4</td><td>B</td></tr><tr><td>3</td><td>C</td></tr><tr><td>2</td><td>D</td></tr><tr><td>1</td><td>F</td></tr></tbody></table></figure>"
      ]
    },
    {
      "title": "Special Immersive Opportunities",
      "content": []
    },
    {
      "title": "Student Life",
      "content": [
        "<p>The program will provide students with information about cultural and academic events that take place in and around Havana. Topics may include Cuban music, gastronomy, religion, race and ethnicity, sports, and politics.</p>",
        "<p>Students may engage in extracurricular activities such as community-based volunteer opportunities. They may also work with Casa de las Américas on specific projects such as publications, exhibitions, theatre, conferences, or other initiatives.</p>",
        "<p>For students who are interested in the arts, the city of Havana offers a variety of free and low cost concerts and performances. Local dance and music instructors are readily available for students who want to begin or continue their musical education while abroad.</p>"
      ]
    },
    {
      "title": "Housing",
      "content": [
        "<p>Students will share accommodations in a residence provided by Casa de las Américas or administered by Cuban families in a homestay setting. All residences are located in the Vedado district of Havana within walking distance of Casa de las Américas and the University of Havana. Breakfast and dinner will be provided each day. Laundry will be taken care of by each residence.</p>"
      ]
    },
    {
      "title": "Location",
      "content": [
        "<p>One of the longest running socialist experiments in history, Cuba is at a critical crossroads. Cuba’s political and economic spheres have long been subjects of interest and debate, providing fertile ground for exciting academic inquiry. Havana, the capital city, was founded nearly 500 years ago. Due to its location it became a center of ship-building in the Caribbean and a strategic stopping point in the Spanish colonial empire. Today it is a sprawling metropolis, home to 2 million residents and incorporating a mix of European, Latin, and American influences. Historic Old Havana with its diverse architectural styles has been named a UNESCO World Heritage site.</p>",
        "<p>CASA Cuba, the University of Havana, and Casa de Las Américas have worked together to develop a program of study that will challenge students to achieve a critical understanding of contemporary Cuba, and enable interaction with some of the country's leading academic experts in the social sciences, arts, and humanities. Students will immerse themselves in Cuba, taking credit-bearing lectures from recognized experts in Spanish on key issues facing the country, and interacting with peers who share an intellectual curiosity about Cuba's past, present, and future.</p>"
      ]
    }
  ],
  "budget_page_url": "https://www.vanderbilt.edu/study-abroad/budgets/?program_id=2261"
}